---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.FluidDensity
source: html/dd4324e0-5979-382a-f7b9-a8a8312b2188.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.FluidDensity Property

The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).

## Syntax (C#)
```csharp
public double FluidDensity { get; }
```